app/controllers/api/drinks_controller.rb

SELECT  "drinks".* FROM "drinks" ORDER BY "drinks"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    drinks = Drink.all

INSERT INTO "drinks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Andrea's Michealda"], ["description", "A sexy Summer Drink with Beer"], ["created_at", "2017-06-19 23:21:20.534275"], ["updated_at", "2017-06-19 23:21:20.534275"]]
INSERT INTO "ingredients" ("name", "unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Beer"], ["unit", "mickey"], ["created_at", "2017-06-19 23:21:20.661184"], ["updated_at", "2017-06-19 23:21:20.661184"]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = $1 AND "ingredients"."unit" = $2 LIMIT $3  [["name", "Beer"], ["unit", "mickey"], ["LIMIT", 1]]
INSERT INTO "drink_ingredients" ("drink_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["drink_id", 3], ["ingredient_id", 23], ["created_at", "2017-06-19 23:21:20.752527"], ["updated_at", "2017-06-19 23:21:20.752527"]]
INSERT INTO "equipment" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pint"], ["created_at", "2017-06-19 23:21:20.970723"], ["updated_at", "2017-06-19 23:21:20.970723"]]
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."name" = $1 LIMIT $2  [["name", "Pint"], ["LIMIT", 1]]
INSERT INTO "drink_equipments" ("drink_id", "equipment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["drink_id", 3], ["equipment_id", 9], ["created_at", "2017-06-19 23:21:21.010330"], ["updated_at", "2017-06-19 23:21:21.010330"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Michelada"], ["created_at", "2017-06-19 23:21:21.037731"], ["updated_at", "2017-06-19 23:21:21.037731"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "Michelada"], ["LIMIT", 1]]
INSERT INTO "drink_tags" ("drink_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["drink_id", 3], ["tag_id", 7], ["created_at", "2017-06-19 23:21:21.092734"], ["updated_at", "2017-06-19 23:21:21.092734"]]
INSERT INTO "steps" ("name", "length_of_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pour Beer In Pint"], ["length_of_time", 5], ["created_at", "2017-06-19 23:21:21.166750"], ["updated_at", "2017-06-19 23:21:21.166750"]]
SELECT  "steps".* FROM "steps" WHERE "steps"."name" = $1 AND "steps"."length_of_time" = $2 LIMIT $3  [["name", "Pour Beer In Pint"], ["length_of_time", 5], ["LIMIT", 1]]
INSERT INTO "drink_steps" ("drink_id", "step_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["drink_id", 3], ["step_id", 13], ["created_at", "2017-06-19 23:21:21.190485"], ["updated_at", "2017-06-19 23:21:21.190485"]]
---
  def create
    drink = Drink.create(drinks_params)
    params['drink']['ingredients'].each {|ingre|
      ing = Ingredient.find_or_create_by(name: ingre['name'], unit: ingre['unit'])
        amount = ingre['quantity'].to_i*2
        amount.times do
          DrinkIngredient.create(drink_id: drink.id, ingredient_id: ing.id)
        end
      }

    params['drink']['equipments'].each {|equip|
      equ = Equipment.find_or_create_by(name: equip['name'])
          DrinkEquipment.create(drink_id: drink.id, equipment_id: equ.id)
      }

    params['drink']['tags'].each {|tag|
      t = Tag.find_or_create_by(name: tag['name'])
          DrinkTag.create(drink_id: drink.id, tag_id: t.id)
      }

    params['drink']['steps'].each {|step|
      s = Step.find_or_create_by(name: step['name'], length_of_time: step['length_of_time'])
          DrinkStep.create(drink_id: drink.id, step_id: s.id)